In [1]:
import pandas as pd
import os

!pip install psycopg2
from sqlalchemy import create_engine

print(pd.__version__)
os.listdir()

Requirement already satisfied: psycopg2 in c:\users\wydar\anaconda3\lib\site-packages (2.9.10)
2.2.2

['.ipynb_checkpoints',
 'green_tripdata_2019-10.csv.gz',
 'homework.md',
 'taxi_zone_lookup.csv',
 'Untitled.ipynb']

In [7]:
df = pd.read_csv("green_tripdata_2019-10.csv.gz")
df.lpep_pickup_datetime = pd.to_datetime(df.lpep_pickup_datetime)
df.lpep_dropoff_datetime = pd.to_datetime(df.lpep_dropoff_datetime)

print(df.dtypes)
df.head(1)

C:\Users\wydar\AppData\Local\Temp\ipykernel_36860\2637191663.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("green_tripdata_2019-10.csv.gz")

VendorID                        float64
lpep_pickup_datetime     datetime64[ns]
lpep_dropoff_datetime    datetime64[ns]
store_and_fwd_flag               object
RatecodeID                      float64
PULocationID                      int64
DOLocationID                      int64
passenger_count                 float64
trip_distance                   float64
fare_amount                     float64
extra                           float64
mta_tax                         float64
tip_amount                      float64
tolls_amount                    float64
ehail_fee                       float64
improvement_surcharge           float64
total_amount                    float64
payment_type                    float64
trip_type                       float64
congestion_surcharge            float64
dtype: object

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2.0,2019-10-01 00:26:02,2019-10-01 00:39:58,N,1.0,112,196,1.0,5.88,18.0,0.5,0.5,0.0,0.0,NaN,0.3,19.3,2.0,1.0,0.0

In [8]:
engine = create_engine("postgresql://root:root@localhost:5432/ny_taxi")

In [9]:
print(pd.io.sql.get_schema(df, name="green_taxi_data", con=engine))

CREATE TABLE green_taxi_data (
	"VendorID" FLOAT(53),
	lpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	lpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	store_and_fwd_flag TEXT,
	"RatecodeID" FLOAT(53),
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	passenger_count FLOAT(53),
	trip_distance FLOAT(53),
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	ehail_fee FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	payment_type FLOAT(53),
	trip_type FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [11]:
df_zones = pd.read_csv("taxi_zone_lookup.csv")

print(df_zones.dtypes)
df_zones.head(1)

LocationID       int64
Borough         object
Zone            object
service_zone    object
dtype: object

   LocationID Borough            Zone service_zone
0           1     EWR  Newark Airport          EWR

In [12]:
print(pd.io.sql.get_schema(df_zones, name="zones", con=engine))

CREATE TABLE zones (
	"LocationID" BIGINT,
	"Borough" TEXT,
	"Zone" TEXT,
	service_zone TEXT
)

In [13]:
df.head(n=0).to_sql(name="green_taxi_data", con=engine, if_exists="replace")
df_zones.head(n=0).to_sql(name="zones", con=engine, if_exists="replace")

0

In [14]:
df.to_sql(name="green_taxi_data", con=engine, if_exists="append")
df_zones.to_sql(name="zones", con=engine, if_exists="append")

265

In [44]:
query = """
SELECT COUNT(1)
FROM
	green_taxi_data t
;
"""

print(pd.read_sql(query, con=engine))

query = """
SELECT COUNT(1)
FROM
	zones z
;
"""

print(pd.read_sql(query, con=engine))

    count
0  476386
   count
0    265

In [21]:
query = """
SELECT 
DATE(lpep_pickup_datetime)
,
	*
FROM
	green_taxi_data t
ORDER BY trip_distance DESC
LIMIT 1;
"""

pd.read_sql(query, con=engine)

,date,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,...,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
0,2019-10-31,386795,2.0,2019-10-31 23:23:41,2019-11-01 13:01:07,N,5.0,129,265,1.0,...,2.75,0.0,0.0,0.0,None,0.3,103.05,2.0,1.0,0.0

In [37]:
query = """
SELECT 
DATE(lpep_pickup_datetime)
,
trip_distance
FROM
	green_taxi_data t
WHERE DATE(lpep_pickup_datetime) = '2019-10-31'
ORDER BY trip_distance DESC
LIMIT 3;
"""

pd.read_sql(query, con=engine)

         date  trip_distance
0  2019-10-31         515.89
1  2019-10-31          43.13
2  2019-10-31          39.22

In [34]:
query = """
SELECT 
DATE(lpep_pickup_datetime),
MAX(trip_distance)
FROM
	green_taxi_data t
WHERE DATE(lpep_pickup_datetime) IN ('2019-10-11', '2019-10-24', '2019-10-26', '2019-10-31')
GROUP BY DATE(lpep_pickup_datetime)
;
"""

pd.read_sql(query, con=engine)

         date     max
0  2019-10-26   91.56
1  2019-10-31  515.89
2  2019-10-24   90.75
3  2019-10-11   95.78

In [47]:
query = """
SELECT 
    DATE(lpep_pickup_datetime),
    trip_distance,
    total_amount,
    CONCAT(zpu."Borough", ' / ', zpu."Zone") AS "pick_up_loc",
	CONCAT(zdo."Borough", ' / ', zdo."Zone") AS "dropoff_loc"
FROM
	green_taxi_data t,
    zones zpu,
	zones zdo
WHERE DATE(lpep_pickup_datetime) = '2019-10-18' AND
	t."PULocationID" = zpu."LocationID" AND
	t."DOLocationID" = zdo."LocationID"
;
"""

pd.read_sql(query, con=engine)#.columns

,date,trip_distance,total_amount,pick_up_loc,dropoff_loc
0,2019-10-18,6.34,22.30,Bronx / West Concourse,Manhattan / Clinton East
1,2019-10-18,1.67,9.30,Queens / Elmhurst,Queens / Elmhurst
2,2019-10-18,7.69,39.36,Manhattan / East Harlem North,Manhattan / Hamilton Heights
3,2019-10-18,7.52,36.05,Brooklyn / Park Slope,Manhattan / Midtown South
4,2019-10-18,0.00,3.80,Queens / Queensbridge/Ravenswood,Queens / Queensbridge/Ravenswood
...,...,...,...,...,...
17651,2019-10-18,9.00,34.04,Brooklyn / East New York,Brooklyn / Red Hook
17652,2019-10-18,10.51,37.06,Brooklyn / Canarsie,Queens / Long Island City/Hunters Point
17653,2019-10-18,2.25,27.91,Queens / Jamaica,Queens / Briarwood/Jamaica Hills
17654,2019-10-18,9.87,35.59,Bronx / West Concourse,Manhattan / Murray Hill
17655,2019-10-18,5.55,29.45,Bronx / Melrose South,Manhattan / Lenox Hill East

In [69]:
query = """
SELECT 
    SUM(total_amount),
    zpu."Zone" AS "pick_up_loc"
FROM
	green_taxi_data t,
    zones zpu,
	zones zdo
WHERE DATE(lpep_pickup_datetime) = '2019-10-18' AND
	t."PULocationID" = zpu."LocationID" AND
	t."DOLocationID" = zdo."LocationID"
GROUP BY pick_up_loc
ORDER BY sum DESC
LIMIT 5
;
"""

pd.read_sql(query, con=engine)#.columns

        sum          pick_up_loc
0  18686.68    East Harlem North
1  16797.26    East Harlem South
2  13029.79  Morningside Heights
3  12440.66       Central Harlem
4  12431.96             Elmhurst

In [68]:
query = """
SELECT SUM(t."total_amount") AS total_amount, z."Zone" AS pick_up_loc
FROM green_taxi_data t
JOIN zones z ON t."PULocationID" = z."LocationID"
WHERE DATE(t."lpep_pickup_datetime") = '2019-10-18'
GROUP BY z."Zone"
ORDER BY total_amount DESC
LIMIT 5
;
"""

pd.read_sql(query, con=engine)

   total_amount          pick_up_loc
0      18686.68    East Harlem North
1      16797.26    East Harlem South
2      13029.79  Morningside Heights
3      12440.66       Central Harlem
4      12431.96             Elmhurst

In [70]:
query = """
SELECT 
    COUNT(CASE WHEN trip_distance <= 1 THEN 1 END) AS "Up_to_1_mile",
    COUNT(CASE WHEN trip_distance > 1 AND trip_distance <= 3 THEN 1 END) AS "Between_1_and_3_miles",
    COUNT(CASE WHEN trip_distance > 3 AND trip_distance <= 7 THEN 1 END) AS "Between_3_and_7_miles",
    COUNT(CASE WHEN trip_distance > 7 AND trip_distance <= 10 THEN 1 END) AS "Between_7_and_10_miles",
    COUNT(CASE WHEN trip_distance > 10 THEN 1 END) AS "Over_10_miles"
FROM
    green_taxi_data
WHERE 
    DATE(lpep_pickup_datetime) >= '2019-10-01' AND
    DATE(lpep_pickup_datetime) < '2019-11-01';
;
"""

pd.read_sql(query, con=engine)te

,Up_to_1_mile,Between_1_and_3_miles,Between_3_and_7_miles,Between_7_and_10_miles,Over_10_miles
0,104830,198995,109642,27686,35201

In [77]:
query = """
SELECT 
    COUNT(1) AS "Up_to_1_mile"
FROM
    green_taxi_data
WHERE 
    trip_distance <= 1 AND
    DATE(lpep_pickup_datetime) >= '2019-10-01' AND
    DATE(lpep_pickup_datetime) < '2019-11-01';
;
"""

pd.read_sql(query, con=engine)

   Up_to_1_mile
0        104830

In [79]:
query = """
SELECT 
    zdo."Zone" AS drop_off_loc, 
    MAX(t."tip_amount") AS largest_tip
FROM
    green_taxi_data t
JOIN 
    zones zpu ON t."PULocationID" = zpu."LocationID"
JOIN
    zones zdo ON t."DOLocationID" = zdo."LocationID"
WHERE 
    DATE(t."lpep_pickup_datetime") >= '2019-10-01' AND
    DATE(t."lpep_pickup_datetime") < '2019-11-01' AND
    zpu."Zone" = 'East Harlem North'
GROUP BY 
    zdo."Zone"
ORDER BY 
    largest_tip DESC
LIMIT 1;
"""

pd.read_sql(query, con=engine)

  drop_off_loc  largest_tip
0  JFK Airport         87.3